OpenFOAM/K-Epsilon/Fine-Mesh/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.000258;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.000258;
    }

    outlet
    {
        type            zeroGradient;
    }

    wall_int
    {
        type            epsilonWallFunction;
        value           uniform 0.000258;
    }

    wall_ext
    {
        type            epsilonWallFunction;
        value           uniform 0.000258;
    }

    freestream
    {
        type            zeroGradient;
    }

    symmetry
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
